{"_id":{"$oid":"629fab32a91e4cf09f1ac96a"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNjNhZTk0ZmEtNjJhMi00YzFlLWE1MmEtYzM1M2ZmMGMwMTU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg" ,"Featured":true,"Actors":["Anthony Hopkins"]}
{"_id":{"$oid":"629fc495a91e4cf09f1ac96c"},"Title":"The Godfather","Description":"The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.","Year":"1972","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."},"Director":{"Name":"Francis Ford Coppola","Bio":"American film director, producer, and screenwriter. He is considered one of the major figures of the New Hollywood filmmaking movement of the 1960s and 1970s and is the recipient of five Academy Awards, six Golden Globe Awards, two Palmes d'Or, and a British Academy Film Award.","Birth":"1939"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg","Featured":true,"Actors":["Marlon Brando"]}
{"_id":{"$oid":"629fc9c6a91e4cf09f1ac96d"},"Title":"Forrest Gump","Description":"The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.","Year":"1994","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Robert Zemeckis","Bio":"is an American film director, producer, and screenwriter. He first came to public attention as the director of the action-adventure romantic comedy Romancing the Stone (1984), the science-fiction comedy Back to the Future film trilogy (1985–90), and the live-action/animated comedy Who Framed Roger Rabbit (1988).","Birth":"1952"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNWIwODRlZTUtY2U3ZS00Yzg1LWJhNzYtMmZiYmEyNmU1NjMzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_FMjpg_UX1000_.jpg","Actors":["Tom Hanks"],"Featured":false}
{"_id":{"$oid":"629fcfb7a91e4cf09f1ac96e"},"Title":"Pulp Fiction","Description":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Year":"1994","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."},"Director":{"Name":"Quentin Taratino","Bio":"An American filmmaker, actor, film critic and author. His films are characterized by frequent references to popular culture and film history, nonlinear storylines, dark humor, stylized violence, extended dialogue, pervasive use of profanity, cameos and ensemble casts.","Birth":"1963"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/3/3b/Pulp_Fiction_%281994%29_poster.jpg","Actors":["Samuel L. Jackson"],"Featured":true}
{"_id":{"$oid":"629fd69ba91e4cf09f1ac96f"},"Title":"Star Wars: Episode V - The Empire Strikes Back","Description":"After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett.","Year":"1980","Genre":{"Name":"Science-fiction","Description":"Fiction dealing principally with the impact of actual or imagined science on society or individuals or having a scientific factor as an essential orienting component."},"Director":{"Name":"Irvin Kershner","Bio":"Was an American director, actor, and producer of film and television. He gained notice early in his career as a filmmaker for directing quirky, independent drama films, while working as an influential lecturer at the University of Southern California. Later in his career, he transitioned to high-budget blockbusters such as The Empire Strikes Back, the James Bond adaptation Never Say Never Again, and RoboCop 2. Through the course of his career, he received numerous accolades, and was nominated for both a Primetime Emmy Award and a Palme d'Or.","Birth":"1923","Death":"2010"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYmU1NDRjNDgtMzhiMi00NjZmLTg5NGItZDNiZjU5NTU4OTE0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg","Actors":["Harrison Ford"],"Featured":false}
{"_id":{"$oid":"629fec97a91e4cf09f1ac970"},"Title":"Saving Private Ryan","Description":"Captain John Miller (Tom Hanks) takes his men behind enemy lines to find Private James Ryan, whose three brothers have been killed in combat. Surrounded by the brutal realties of war, while searching for Ryan, each man embarks upon a personal journey and discovers their own strength to triumph over an uncertain future with honor, decency and courage.","Year":"1998","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Steven Spielberg","Bio":"One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world. He has an extraordinary number of commercially successful and critically acclaimed credits to his name, either as a director, producer or writer since launching the summer blockbuster with Jaws (1975), and he has done more to define popular film-making since the mid-1970s than anyone else.","Birth":"1946"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BZjhkMDM4MWItZTVjOC00ZDRhLThmYTAtM2I5NzBmNmNlMzI1XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_FMjpg_UX1000_.jpg","Actors":["Tom Hanks"],"Featured":false}
{"_id":{"$oid":"629fee53a91e4cf09f1ac971"},"Title":"Inglourious Basterds","Description":"In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.","Year":"2009","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Quentin Tarantino","Bio":"An American filmmaker, actor, film critic and author. His films are characterized by frequent references to popular culture and film history, nonlinear storylines, dark humor, stylized violence, extended dialogue, pervasive use of profanity, cameos and ensemble casts.","Birth":"1963"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BOTJiNDEzOWYtMTVjOC00ZjlmLWE0NGMtZmE1OWVmZDQ2OWJhXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_FMjpg_UX1000_.jpg","Actors":["Brad Pitt"],"Featured":false}
{"_id":{"$oid":"629ff095a91e4cf09f1ac972"},"Title":"Alien","Description":"The crew of a commercial spacecraft encounter a deadly lifeform after investigating an unknown transmission.","Year":"1979","Genre":{"Name":"Horror","Description":"Horror is a film genre that seeks to elicit fear or disgust in its audience for entertainment purposes."},"Director":{"Name":"Ridley Scott","Bio":"Is an English film director and producer. He has directed, among others, the science fiction films Alien (1979), Blade Runner (1982) and The Martian (2015), the road crime film Thelma & Louise (1991), the historical drama film Gladiator (2000), and the war film Black Hawk Down (2001).","Birth":"1937"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BOGQzZTBjMjQtOTVmMS00NGE5LWEyYmMtOGQ1ZGZjNmRkYjFhXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg","Actors":["Sigourney Weaver"],"Featured":false}
{"_id":{"$oid":"629ff451a91e4cf09f1ac973"},"Title":"WALL-E","Description":"In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind.","Year":"2008","Genre":{"Name":"Animation","Description":"An animated cartoon is an animated film, featuring an exaggerated visual style. The style takes inspiration from comic strips, often featuring anthropomorphic animals, superheroes, or the adventures of human protagonists (either children or adults)."},"Director":{"Name":"Andrew Stanton","Bio":"Is an American animator, storyboard artist, film director, screenwriter, producer and voice actor based at Pixar, which he joined in 1990. His film work includes co-writing and co-directing Pixar's A Bug's Life (1998), directing Finding Nemo (2003) and the sequel Finding Dory (2016), WALL-E (2008), and the live-action film, Disney's John Carter (2012), and co-writing all four Toy Story films (1995–2019) and Monsters, Inc. (2001).","Birth":"1965"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMjExMTg5OTU0NF5BMl5BanBnXkFtZTcwMjMxMzMzMw@@._V1_.jpg","Actors":["Ben Burtt"],"Featured":true}
{"_id":{"$oid":"629ff6e1a91e4cf09f1ac974"},"Title":"Step Brothers","Description":"Two aimless middle-aged losers still living at home are forced against their will to become roommates when their parents marry.","Year":"2008","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film which emphasizes humor. These films are designed to make the audience laugh through amusement."},"Director":{"Name":"Adam McKay","Bio":"Is an American screenwriter, director, comedian, and actor. McKay has a comedy partnership with Will Ferrell, with whom he co-wrote the films Anchorman, Talladega Nights, and The Other Guys. Ferrell and McKay also founded their comedy website Funny or Die through their production company Gary Sanchez Productions. He has been married to Shira Piven since 1999. They have two children.","Birth":"1968"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BODViZDg3ZjYtMzhiYS00YTVkLTk4MzktYWUxMTlkYjc1NjdlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg","Actors":["Will Ferrell"],"Featured":true}
